app/controllers/accounts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def profile
    @user = User.find(params[:id])

UPDATE "users" SET "password_digest" = '$2a$10$zcEzmirikXgb2cqJ8ZwfQO1uMqb5zpnIBYrrtvJA8B0eCiWJXdCfi', "updated_at" = '2012-07-03 09:58:37.002144' WHERE "users"."id" = 1
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])

INSERT INTO "users" ("admin", "created_at", "email", "name", "owner_id", "password_digest", "password_reset_sent_at", "perishable_token", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save