app/controllers/assignments_controller.rb

  def new
    @questions = @course.questions.where("parent_id is NULL")
---
SELECT "questions".id FROM "questions" INNER JOIN "assignment_entries" ON "questions"."id" = "assignment_entries"."question_id" WHERE "assignment_entries"."assignment_id" IS NULL ORDER BY assignment_entries.number