app/controllers/courses_controller.rb

  def create
    if @course.save
      membership = CourseMembership.new(course: @course, user: current_user, role: CourseMembership.instructor_role)
	  if membership.save
---
INSERT INTO "courses" ("conference", "created_at", "description", "name", "rating", "shortname", "term", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "course_memberships" ("course_id", "created_at", "role", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["course_id", 1], ["created_at", Sun, 22 Apr 2012 13:34:07 PDT -07:00], ["role", 1], ["updated_at", Sun, 22 Apr 2012 13:34:07 PDT -07:00], ["user_id", 1]]

  def index
    order = sortable_column_order
    @courses = Course.order(order).paginate(:per_page=>3, :page=>params[:page])
---
SELECT "courses".* FROM "courses" ORDER BY created_at desc

  def update
    if @course.update_attributes(params[:course])
---
UPDATE "courses" SET "name" = 'Paper 1', "shortname" = '', "description" = 'This is where the link for Paper 1 will be', "term" = '', "year" = NULL, "updated_at" = '2012-07-03 05:05:04.336207' WHERE "courses"."id" = 1