app/controllers/course_memberships_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "course_memberships" ("course_id", "created_at", "role", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["course_id", 1], ["created_at", Sun, 22 Apr 2012 13:35:18 PDT -07:00], ["role", 0], ["updated_at", Sun, 22 Apr 2012 13:35:18 PDT -07:00], ["user_id", 2]]
---
  def create
    @course = Course.find(params[:course_id])

    if @course.has_member?(current_user)
      flash[:notice] = "You've already read this paper!"
      redirect_to courses_path and return
    end

    course_membership = CourseMembership.new(user: current_user, course: @course, role: CourseMembership.student_role)
    if course_membership.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "course_memberships".* FROM "course_memberships" WHERE "course_memberships"."course_id" = 2 AND (user_id = 2) LIMIT 1
DELETE FROM "course_memberships" WHERE "course_memberships"."id" = ?  [["id", 4]]
---
  def destroy
    @course = Course.find(params[:course_id])

    @course_membership = CourseMembership.find(params[:id])

    if not @course.has_member?(current_user)
      flash[:notice] = "You've not read this paper."
      redirect_to courses_path and return
    end

    @course_membership.destroy