app/controllers/lectures_controller.rb

SELECT "questions".* FROM "questions" WHERE (course_id = 3) AND (parent_id is NULL)
---
  def new
    @questions = Question.accessible_by(current_ability, :read).where('parent_id is NULL')