app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE (course_id = 1) AND (parent_id is NULL AND (lower(title) LIKE '%sx%' OR lower(text) LIKE '%sx%'))
---
  def search
    key = params[:key] || ""
    @questions = Question.accessible_by(current_ability, :read).where('parent_id is NULL AND (lower(title) LIKE ? OR lower(text) LIKE ?)', "%#{key}%", "%#{key}%")