app/views/layouts/_course_menu.haml

SELECT COUNT(*) FROM "courses" INNER JOIN "course_memberships" ON "courses"."id" = "course_memberships"."course_id" WHERE "course_memberships"."user_id" = 1
---

/  -if current_user and current_user.courses.count > 0